In [1]:
import pandas as pd
import re
import numpy as np

In [2]:
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
df = pd.read_csv('../items.csv')
df['all_laptops']

0    Acer Predator Helios 300 Gaming Laptop, Intel ...
Name: all_laptops, dtype: object

In [20]:
# select acer, asus, etc
pattern = ',+[A-Z]+[a-z]+'
company = re.findall(pattern, df['all_laptops'][0]) #returns the list of all caps
#company2 = re.findall(',+\s+[A-Z]+', df['all_laptops'][0])
df1 = pd.DataFrame(data=company, columns=['companies'])
df1

     companies
0        ,Asus
1        ,Acer
2      ,Silver
3      ,Lenovo
4        ,Acer
5      ,Silver
6   ,Alienware
7        ,Dell
8        ,Acer
9      ,Lenovo
10      ,Razer
11       ,Asus

In [21]:
len(df1['companies'])

12

In [22]:
# companies with their chipset
stri = df['all_laptops'][[0]].tolist()
sub = ['Intel', 'AMD']
i = 0
n = len(stri)

print(type(stri))
print(type(sub))
while i<n:
    pos = stri.find(sub, i, n)
    i += 1
    print(pos)

<class 'list'>
<class 'list'>

AttributeError: 'list' object has no attribute 'find'

In [23]:
# after selecting the companies, select the price
df['price_laptop_in_USD'][0]

'1,129,792,349,857,349,699,1,796,1,269,999,674,857,1,049,699,897,1,799,684,999,1,045,2,549,755'

In [24]:
pattern2 = ',+[0-2]+,+[0-9]+'
price = re.findall(pattern2, df['price_laptop_in_USD'][0])
#print(price)
#price_list = df['price_laptop_in_USD'].tolist()
pattern3 = ',+[3-9]+'
other_price = re.findall(pattern3, df['price_laptop_in_USD'][0])
del other_price[0]
type(other_price)
df1['prices'] = other_price[:len(df1['companies'])]
df1

     companies prices
0        ,Asus   ,349
1        ,Acer   ,857
2      ,Silver   ,349
3      ,Lenovo   ,699
4        ,Acer   ,796
5      ,Silver   ,999
6   ,Alienware   ,674
7        ,Dell   ,857
8        ,Acer   ,699
9      ,Lenovo   ,897
10      ,Razer   ,799
11       ,Asus   ,684

In [25]:
# ratings part
df['rated_from']

0    138,994,5,710,517,5,710,14,48,122,50,16,94,517...
Name: rated_from, dtype: object

In [26]:
x = df['rated_from'].tolist()
a = [rate for rate in x for rate in rate.split(",")]
a

['138',
 '994',
 '5',
 '710',
 '517',
 '5',
 '710',
 '14',
 '48',
 '122',
 '50',
 '16',
 '94',
 '517',
 '109',
 '14',
 '106',
 '185',
 '10',
 '6',
 '142',
 '13',
 '186']

In [27]:
df1['rated_by'] = a[:len(df1['companies'])]

In [28]:
df1

     companies prices rated_by
0        ,Asus   ,349      138
1        ,Acer   ,857      994
2      ,Silver   ,349        5
3      ,Lenovo   ,699      710
4        ,Acer   ,796      517
5      ,Silver   ,999        5
6   ,Alienware   ,674      710
7        ,Dell   ,857       14
8        ,Acer   ,699       48
9      ,Lenovo   ,897      122
10      ,Razer   ,799       50
11       ,Asus   ,684       16

In [31]:
# cleaning more
df1['companies'] = df1['companies'].replace({',':''}, regex=True)
df1['prices'] = df1['prices'].replace({',':''}, regex=True)

In [32]:
df1

    companies prices rated_by
0        Asus    349      138
1        Acer    857      994
2      Silver    349        5
3      Lenovo    699      710
4        Acer    796      517
5      Silver    999        5
6   Alienware    674      710
7        Dell    857       14
8        Acer    699       48
9      Lenovo    897      122
10      Razer    799       50
11       Asus    684       16

In [33]:
df1.to_csv('cleaned_data.csv')